import { phrase } from "@utils/helpers";
import { Style } from "./style";

export const PostalDude = {
	win: [
		phrase("Чел, ты хоть раз компьютер вообще включал?", Style.Default, 100),
		phrase("Кис-кис-кис-кис-кис", Style.Sarcasm, 100),
		phrase("Выкуси", Style.Default, 100),
		phrase("Я не вижу причин сомневаться в себе… сегодня", Style.Default, 100),
		phrase(
			"Благослови меня, отче, я с-с-сильно согрешил, оч-чень сильно! Не, я не шучу, я БОЛЬШОЙ ГРЕШНИК, да!",
			Style.Default,
			100,
		),
		phrase(
			"Купить молока - сделано, обналичить чек - сделано, твоя мама - в процессе",
			Style.Default,
			100,
		),
		phrase("Ха, теперь ты точно должен подписать петицию", Style.Default, 100),
		phrase("Ещё одна победа для демократии", Style.Default, 100),
		phrase("Хахахаха, ты... Эээ... Я не придумал, но ты точно не крутой", Style.Default, 100),
		phrase(
			"Ты, вероятно, и не думал, что тебе суждено проиграть сегодня… Сюрприз!!!",
			Style.Default,
			100,
		),
	],
	loose: [
		phrase(
			"Окей-окей, выиграл в крестиках ноликах у единиц и ноликов. Позови мамочку, похвастайся перед ней",
			Style.Default,
			100,
		),
		phrase(
			"Даже проигрывать в этой параше мне нравится больше, чем выигрывать в minds eye",
			Style.Default,
			100,
		),
		phrase("Может хотя бы петицию подпишешь?", Style.Default, 100),
		phrase("Мой нолик… унижен! Чёрт возьми!", Style.Default, 100),
		phrase("Мы оба проиграли… в каком-то смысле", Style.Default, 100),
		phrase("Ничья — ещё один повод устроить катастрофу", Style.Sarcasm, 100),
		phrase("Ты же понимаешь, что интернет не анонимен, да?", Style.Default, 100),
		phrase("Я чувствую себя дерьмом.", Style.Default, 100),
		phrase("Я... ни о чём... не жалею.", Style.Default, 100),
		phrase(
			"Что-то у тебя слишком много радости, для человека с поджигаемым домом",
			Style.Default,
			100,
		),
	],
	draw: [
		phrase("Да ты просто засрал своими крестиками всё поле", Style.Default, 100),
		phrase("Раз мы разошлись полюбовно... Подпишешь петицию?", Style.Default, 100),
		phrase("Мы оба проиграли. Но ты больше", Style.Default, 100),
		phrase("Чувак... Мы по ходу оба проиграли...", Style.Default, 100),
		phrase("Ничья? Черт, я думал это будет хаос... А тут просто ничто", Style.Default, 100),
		phrase("И даже ничего не взорвалось? Я ра-зо-ча-ро-ван", Style.Default, 100),
		phrase("Неужели мы не можем ужиться?", Style.Sarcasm, 100),
		phrase("Эй, ну по крайней мере новости не все плохие.", Style.Default, 100),
	],
	defense: [
		phrase("Хрен там. Не так быстро.", Style.Sarcasm, 100),
		phrase("Думаешь ты самый умный? Вряд ли", Style.Sarcasm, 100),
		phrase("Посмотрим что ты ещё можешь выкинуть", Style.Default, 100),
		phrase("Петиция или хаос — выбор за тобой!", Style.Default, 100),
		phrase("Нет!", Style.Sarcasm, 100),
		phrase("Ни за что!", Style.Sarcasm, 100),
		phrase("Не выйдет!", Style.Sarcasm, 100),
	],
	center: [
		phrase("Центр это как бензин... Дорожает?", Style.Sarcasm, 100),
		phrase("Вы не подпишите мою петицию?", Style.Sarcasm, 100),
		phrase("Счёт!", Style.Sarcasm, 100),
		phrase("Теперь-то ты точно в жопе...", Style.Default, 100),
	],
	random: [
		phrase("Сдавайся или смерть - выбирай пока не решил я", Style.Sarcasm, 100),
		phrase("Впечатлен? Да? Нет? Насрать", Style.Sarcasm, 100),
		phrase("Эм...", Style.Sarcasm, 100),
		phrase("Ладно.", Style.Default, 100),
		phrase("Хм.", Style.Sarcasm, 100),
		phrase("А че за игра вообще? Как стрелять?", Style.Default, 100),
	],
	fork: [
		phrase("Вилкой в глаз или... го некст?", Style.Default, 100),
		phrase("ХАХА, ДВЕ УГРОЗЫ СРАЗУ. Я ГЕНИЙ", Style.Default, 100),
		phrase("Двойной сюрприз, мудила", Style.Sarcasm, 100),
		phrase(
			"Это не может быть полезно для меня, но я чувствую себя ОТЛИЧНО! ",
			Style.Sarcasm,
			100,
		),
		phrase("Я равноправный псих!", Style.Sarcasm, 100),
		phrase("И ещё одну для верности!", Style.Sarcasm, 100),
	],
	emojiPresets: {
		aiWin: ["💀", "☠️", "🔪", "🩸", "😈", "🤡", "🖕", "🔫", "💣", "🧨"],
		aiLoose: ["🔥", "💥", "⚡", "😎", "🖕", "🤯", "💰", "🤙", "👌", "🏆"],
	},
};
